{"name":"Silvio Ciarrocchi","headline":"Principal UI Engineer at Avenue Code","location":"San Francisco Bay Area500+ connections","about":{"aboutHeading":"About","aboutContent":"&#x1F3C6;Accomplished web professional with an entrepreneurial spirit, coming up on a decade of experience with web based applications, RESTful web services and UI development. <br><br>&#x1F41D;Motivated self-learner; perpetually looking to develop new skills and take on new challenges.<br><br>&#x1F468;&#x1F3FD;&#x200D;&#x1F4BB;Experienced with large, scalable and distributed enterprise applications.<br><br>&#x1F91C;&#x1F3FD;&#x1F91B;&#x1F3FC;Socially apt and firm believer in leadership by example.<br><br>&#x1F468;&#x200D;&#x1F393;Well versed in Agile, Scrum, Kanban and Lean methodologies.<br><br>&#x1F91D;Particular interest for mentoring and knowledge sharing.<br><br>&#x1F4F1;Very familiar with media, telecommunications and retail industries."},"experience":{"experienceHeading":"Experience","experienceArray":[{"experienceTitle":"Principal UI Engineer","company":"Avenue Code","date":"Aug 2018 - Present","duration":"1 year 10 months","location":"San Francisco Bay Area","description":"Relocated from Montreal Canada to the San Francisco Bay Area to perform consulting duties as Tech Lead UI Engineer for a prominent Fortune 500 client.<br><br>Conduct Technical &amp; Cultural Interviews for UI Engineering candidates.<br><br>Provide Technical Support for the Sales or Talent Acquisition teams during client facing calls or meetings.<br><br>Part of Avenue Code&apos;s Mentorship Program. Mentors help develop fellow Avenue Coder&apos;s skills in specific technologies by keeping them updated on trending frameworks, features, architectural designs, and tools.<br><br>Speak at Avenue Code sponsored Meetups"},{"experienceTitle":"Tech Lead - React, Redux, Emotion","company":"Fortune 500 Company","date":"Aug 2018 - Present","duration":"1 year 10 months","location":"San Francisco Bay Area","description":"Leading a team of engineers to deliver robust and effective UI solutions on all devices, for a large e-commerce application.<br><br>Specializing in the Shopping Path and Checkout segments of the web application. Aiming to deliver a flawless purchasing experience.<br><br>Give Technical Presentations to spread knowledge amongst team members.<br><br>Collaborate with architects, product/project managers, directors, and vendors to solve business problems through efficient communication &amp; technological solutions.<br><br>Increase Unit Test coverage.<br><br>Related knowledge: ES7, Node.js, Webpack, Jasmine, Enzyme, Git, GitLab."},{"experienceTitle":"Volunteer Instructor","company":"Code Nation","date":"Jan 2019 - Present","duration":"1 year 5 months","location":"San Francisco Bay Area","description":"Code Nation equips students in under-resourced high schools with the skills, experiences, and connections that together create access to careers in technology. <br><br>With a volunteer teaching corps that includes hundreds of professional web and software developers, Code Nation mobilizes the tech community to provide tuition-free coding courses and work-based learning programs that promote career readiness."},{"experienceTitle":"Senior Front End Consultant - React js","company":"ShowTix4U","date":"Jan 2018 - Jan 2019","duration":"1 year 1 month","location":"Las Vegas, Nevada Area","description":"Complete rewrite of a PHP Point of Sale (Box Office) web application using React js on the Frontend; we have created a rich UI and enhanced existing functionality. <br><br>All dynamic data is consumed via a RESTful API powered by Node. An &quot;up to the second&quot; ticket reservation system was put in place using Web Sockets. <br><br>Custom solutions were implemented to allow Dymo brand printers to print tickets on location by Box Office employees."},{"experienceTitle":"Front End Consultant - Angular js","company":"Videotron","date":"Aug 2017 - Jan 2018","duration":"6 months","location":"800 Rue de la Gauchetière Ouest, Montréal, QC H5A 1K6","description":"Modification of CMS structure to allow one more level of depth in site structure.<br><br>Recovery of an AngularJS web app developed by a 3rd party &amp; evaluation of necessary effort to integrate Videotron stack.<br><br>Revision of project documentation, revision of linting rules, revision of failing<br>Gulp tasks, revision of automated tests, revision of SCSS structure, &#x201C;dead<br>code&#x201D; cleanup, switch from mock services to back end Mule services."},{"experienceTitle":"Web Developer Analyst","company":"Radio-Canada","date":"Feb 2016 - Aug 2017","duration":"1 year 7 months","location":"1400 Boulevard René-Lévesque E, Montréal, QC H2L 2M2","description":"Collaborate with site teams to drive scalable ad operational improvements and integration projects.<br><br>Manage projects, including integration of external technology, services, and products and develop and drive internal projects and technology changes from concept through delivery.<br><br>Work alongside National Digital Director of Revenue Optimization, Digital Director of Sales &amp; 3rd party partnerships to drive Programmatic revenues.<br><br>Manage all aspects of technical implementation and testing for ad products and custom builds<br>Identify and develop opportunities for creating and improving existing platforms, tools and processes for greater efficiency. This includes gathering data, identifying requirements and project managing from start to finish"},{"company":"RDS","date":"6 years 10 months","experienceGroupArray":[{"experienceTitle":"Sports Columnist","duration":"1 year 1 month","date":"Jul 2015 - Jul 2016","description":"Create entertaining web content for the #FantasyLife initiative. <br><br>Write a Fantasy Football column for the web in order to help enthusiasts make the best possible roster decisions each week.<br><br>Draft a series of 5 preseason columns aimed at setting the stage for the upcoming football season through various predictions. <br><br>Be part of a round table summit to design a draft kit preceding the football season."},{"experienceTitle":"Web Developer","duration":"4 years 3 months","date":"Dec 2011 - Feb 2016","description":"Develop appropriate code structures to solve specific tasks. <br><br>Assume ownership of code throughout development, staging, testing and production.<br>Design efficient ad delivery solutions and provide support for Ad Ops. <br><br>Work within the Agile - Scrum Framework to deliver complex projects.<br><br>Polopoly - DFP - Grunt - Require.js - SASS - Velocity - Java - JBoss - Tomcat - Responsive - Git"},{"experienceTitle":"Interactive Media Creativity Coordinator","duration":"1 year 2 months","date":"Nov 2010 - Dec 2011","description":"Create beautiful high quality sales presentations to support sales representatives.<br><br>Coordinate brand partnership projects within our commercial production and broadcast teams.<br><br>Participate in the creative process of generating, developing, and communicating new ideas.<br><br>Promote and leverage connex BellMedia platforms.<br><br>Support the Ad Ops department with complex web-related executions.<br><br>Strategy - Marketing - Creativity - Broadcast &amp; Digital Media - Powerpoint - Prezi"},{"experienceTitle":"Ad Operations Coordinator","duration":"1 year 2 months","date":"Oct 2009 - Nov 2010","description":"Providing technical solutions for problematic creatives using JavaScript, HTML &amp; CSS.<br><br>Assist in handling third party tags, media assets and instructions from our advertising partners.<br><br>Management of digital advertising campaigns, including delivery, optimization and post-campaign analysis.<br><br>Optimize cost efficiency with ad serving network (DFP).<br><br>DFP - Third Party Tags - Eye Return - Troubleshooting - HTML5 - CSS3 - JavaScript"}]}]},"education":{"educationHeading":"Education","educationArray":[{"school":"McGill University","degree":"Certificate in Systems Analysis and DesignInformation Technology","fieldsArray":["Certificate in Systems Analysis and Design","Information Technology"],"time":null,"society":"","curriculum":"Part-time student within the McGill School of Continuing Studies."},{"school":"ITI du Collège de Maisonneuve","degree":"AEC Web Design and E-commerceWeb Page, Digital/Multimedia and Information Resources Design","fieldsArray":["AEC Web Design and E-commerce","Web Page, Digital/Multimedia and Information Resources Design"],"time":null,"society":"","curriculum":"Acquired knowledge in multiple programming languages &amp; implemented transactional web applications.<br><br><br>"}]},"certifications":{"certificationsHeading":"Licenses & Certifications","certificationsArray":[{"certification":"Scrum Master (PMS I)","subtitle":"Scrum.org","credetials":"Credential ID 322261"}]},"languages":{"languagesHeading":"Languages","languagesArray":[{"language":"English","proficiency":"Native or bilingual proficiency"},{"language":"French","proficiency":"Native or bilingual proficiency"},{"language":"Italian","proficiency":"Elementary proficiency"}]}}